import { defineConfig } from "vitepress";
import markdownItPlantuml from "markdown-it-textual-uml";
import { nav } from "./nav";
import { sidebar } from "./sidebar";
import mdItCustomAttrs from "markdown-it-custom-attrs";
import markdownItTaskLists from "markdown-it-task-lists";

// https://vitepress.dev/reference/site-config
export default defineConfig({
  // base: '/docs/', // 由于使用自定义域名，此处需要注释掉，如果不使用自定义域名的话，可以取消注释
  title: "小让の码场",
  description:
    "包含: Java 核心技术, Spring全家桶, 设计模式, 数据结构与算法, 源码分析，面试宝典...",
  srcDir: "./md",
  head: [
    ["link", { rel: "icon", href: "/favicon.ico" }],
    [
      "link",
      {
        rel: "stylesheet",
        href: "https://cdn.jsdelivr.net/npm/@fancyapps/ui/dist/fancybox.css",
      },
    ],
    [
      "script",
      {
        src: "https://cdn.jsdelivr.net/npm/@fancyapps/ui@4.0/dist/fancybox.umd.js",
      },
    ],
  ],
  lang: "zh-CN",
  ignoreDeadLinks: true,
  lastUpdated: true,
  themeConfig: {
    // https://vitepress.dev/reference/default-theme-config
    logo: "/logo.svg",
    nav,
    socialLinks: [
      { icon: "github", link: "https://github.com/xihuanxiaorang" },
      {
        icon: {
          svg: '<svg t="1706343933559" class="icon" viewBox="0 0 1129 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4223" width="200" height="200"><path d="M234.909 9.656a80.468 80.468 0 0 1 68.398 0 167.374 167.374 0 0 1 41.843 30.578l160.937 140.82h115.07l160.936-140.82a168.983 168.983 0 0 1 41.843-30.578A80.468 80.468 0 0 1 930.96 76.445a80.468 80.468 0 0 1-17.703 53.914 449.818 449.818 0 0 1-35.406 32.187 232.553 232.553 0 0 1-22.531 18.508h100.585a170.593 170.593 0 0 1 118.289 53.109 171.397 171.397 0 0 1 53.914 118.288v462.693a325.897 325.897 0 0 1-4.024 70.007 178.64 178.64 0 0 1-80.468 112.656 173.007 173.007 0 0 1-92.539 25.75h-738.7a341.186 341.186 0 0 1-72.421-4.024A177.835 177.835 0 0 1 28.91 939.065a172.202 172.202 0 0 1-27.36-92.539V388.662a360.498 360.498 0 0 1 0-66.789A177.03 177.03 0 0 1 162.487 178.64h105.414c-16.899-12.07-31.383-26.555-46.672-39.43a80.468 80.468 0 0 1-25.75-65.984 80.468 80.468 0 0 1 39.43-63.57M216.4 321.873a80.468 80.468 0 0 0-63.57 57.937 108.632 108.632 0 0 0 0 30.578v380.615a80.468 80.468 0 0 0 55.523 80.469 106.218 106.218 0 0 0 34.601 5.632h654.208a80.468 80.468 0 0 0 76.444-47.476 112.656 112.656 0 0 0 8.047-53.109v-354.06a135.187 135.187 0 0 0 0-38.625 80.468 80.468 0 0 0-52.304-54.719 129.554 129.554 0 0 0-49.89-7.242H254.22a268.764 268.764 0 0 0-37.82 0z m0 0" fill="#20B0E3" p-id="4224"></path><path d="M348.369 447.404a80.468 80.468 0 0 1 55.523 18.507 80.468 80.468 0 0 1 28.164 59.547v80.468a80.468 80.468 0 0 1-16.094 51.5 80.468 80.468 0 0 1-131.968-9.656 104.609 104.609 0 0 1-10.46-54.719v-80.468a80.468 80.468 0 0 1 70.007-67.593z m416.02 0a80.468 80.468 0 0 1 86.102 75.64v80.468a94.148 94.148 0 0 1-12.07 53.11 80.468 80.468 0 0 1-132.773 0 95.757 95.757 0 0 1-12.875-57.133V519.02a80.468 80.468 0 0 1 70.007-70.812z m0 0" fill="#20B0E3" p-id="4225"></path></svg>',
        },
        link: "https://space.bilibili.com/307881917",
      },
    ],
    sidebar,
    footer: {
      message:
        'Released under the <a href="https://github.com/xihuanxiaorang/docs/blob/main/LICENSE">MIT License</a>.',
      copyright:
        'Copyright © 2024 <a href="https://github.com/xihuanxiaorang">小让</a>',
    },
    editLink: {
      pattern: "https://github.com/xihuanxiaorang/docs/edit/main/docs/md/:path",
      text: "在 GitHub 上编辑此页面",
    },
    lastUpdated: {
      text: "最后更新于",
      formatOptions: {
        dateStyle: "full",
        timeStyle: "medium",
      },
    },
    search: {
      provider: "local",
    },
    outline: {
      level: "deep",
      label: "页面导航",
    },
    docFooter: {
      prev: "上一篇",
      next: "下一篇",
    },
    returnToTopLabel: "回到顶部",
    sidebarMenuLabel: "目录",
    darkModeSwitchLabel: "外观",
  },
  markdown: {
    lineNumbers: true,
    container: {
      tipLabel: `<svg t="1712309798836" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="63924" width="1em" height="1em"><path d="M336 678.4c-105.6-64-176-179.2-176-313.6C160 163.2 323.2 0 524.8 0s364.8 163.2 364.8 364.8c0 131.2-70.4 249.6-176 313.6-6.4 32-19.2 60.8-41.6 86.4h-294.4c-19.2-25.6-35.2-54.4-41.6-86.4z m448-278.4c0-156.8-121.6-278.4-259.2-278.4-22.4 0-35.2 12.8-35.2 35.2 0 6.4 12.8 16 35.2 16 112 0 208 96 208 227.2 0 6.4 12.8 16 35.2 16 6.4 0 16-9.6 16-16z m-416 451.2c0-19.2 16-35.2 35.2-35.2h243.2c19.2 0 35.2 16 35.2 35.2 0 19.2-16 35.2-35.2 35.2h-243.2c-19.2 0-35.2-16-35.2-35.2z m297.6 86.4c-25.6 51.2-80 86.4-140.8 86.4s-115.2-35.2-140.8-86.4h281.6z" fill="#3d8937" p-id="63925"></path><path d="M336 678.4c-105.6-64-176-179.2-176-313.6C160 163.2 323.2 0 524.8 0s364.8 163.2 364.8 364.8c0 131.2-70.4 249.6-176 313.6-6.4 32-19.2 60.8-41.6 86.4h-294.4c-19.2-25.6-35.2-54.4-41.6-86.4z m448-278.4c0-156.8-121.6-278.4-259.2-278.4-22.4 0-35.2 12.8-35.2 35.2 0 6.4 12.8 16 35.2 16 112 0 208 96 208 227.2 0 6.4 12.8 16 35.2 16 6.4 0 16-9.6 16-16z m-416 451.2c0-19.2 16-35.2 35.2-35.2h243.2c19.2 0 35.2 16 35.2 35.2 0 19.2-16 35.2-35.2 35.2h-243.2c-19.2 0-35.2-16-35.2-35.2z m297.6 86.4c-25.6 51.2-80 86.4-140.8 86.4s-115.2-35.2-140.8-86.4h281.6z" fill="#3d8937" p-id="63926"></path></svg> <span class="tip">Tip</span>`,
      warningLabel: `<svg t="1712311779346" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="71837" width="16" height="16"><path d="M934.4 770.133333L605.866667 181.333333C586.666667 147.2 550.4 128 512 128c-38.4 0-74.666667 21.333333-93.866667 53.333333L89.6 770.133333c-19.2 34.133333-19.2 76.8 0 110.933334S145.066667 938.666667 183.466667 938.666667h657.066666c38.4 0 74.666667-21.333333 93.866667-57.6 19.2-34.133333 19.2-76.8 0-110.933334z m-55.466667 81.066667c-8.533333 14.933333-23.466667 23.466667-38.4 23.466667H183.466667c-14.933333 0-29.866667-8.533333-38.4-23.466667-8.533333-14.933333-8.533333-34.133333 0-49.066667L473.6 213.333333c8.533333-12.8 23.466667-21.333333 38.4-21.333333s29.866667 8.533333 38.4 21.333333l328.533333 588.8c8.533333 14.933333 8.533333 32 0 49.066667z" fill="#936700" p-id="71838"></path><path d="M512 746.666667m-42.666667 0a42.666667 42.666667 0 1 0 85.333334 0 42.666667 42.666667 0 1 0-85.333334 0Z" fill="#936700" p-id="71839"></path><path d="M512 629.333333c17.066667 0 32-14.933333 32-32v-192c0-17.066667-14.933333-32-32-32s-32 14.933333-32 32v192c0 17.066667 14.933333 32 32 32z" fill="#936700" p-id="71840"></path></svg> <span class="warning">Warning</span>`,
      noteLabel: `<svg t="1712308321975" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="18730" id="mx_n_1712308321975" width="1em" height="1em"><path d="M512 8a504.064 504.064 0 1 0 0.064 1008.064A504.064 504.064 0 0 0 512 8z m36.032 747.008c0 4.928-4.096 8.96-9.024 8.96h-54.016a9.024 9.024 0 0 1-8.96-8.96V449.024c0-4.992 4.032-9.024 8.96-9.024h54.016c4.928 0 8.96 4.032 8.96 8.96v306.048zM512 368a54.016 54.016 0 1 1 0-108.032 54.016 54.016 0 0 1 0 108.032z" fill="#2d54ac" p-id="18731"></path></svg> <span class="note">Note</span>`,
      importantLabel: `<svg t="1712309582946" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="55927" id="mx_n_1712309582947" width="1em" height="1em"><path d="M512 981.333333c46.933333 0 84.906667-37.973333 84.906667-84.906666h-169.813334c0 46.933333 37.973333 84.906667 84.906667 84.906666z m298.666667-256v-256c0-142.933333-100.693333-262.4-234.666667-291.413333V128c0-35.413333-28.586667-64-64-64s-64 28.586667-64 64v49.92C314.026667 206.933333 213.333333 326.4 213.333333 469.333333v256l-85.333333 85.333334v42.666666h768v-42.666666l-85.333333-85.333334z m-256-42.666666h-85.333334v-85.333334h85.333334v85.333334z m0-170.666667h-85.333334V341.333333h85.333334v170.666667z" fill="#7f4be2" p-id="55928"></path></svg>  <span class="important">Important</span>`,
      cautionLabel: `<svg t="1712310281069" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="70806" data-spm-anchor-id="a313x.search_index.0.i44.66873a819z1wHo" width="1em" height="1em"><path d="M512 0C230.4 0 0 230.4 0 512s230.4 512 512 512 512-230.4 512-512-230.4-512-512-512z m0 816a50.56 50.56 0 0 1-51.2-51.2c0-28.8 22.4-51.2 51.2-51.2 28.8 0 51.2 22.4 51.2 51.2 0 28.8-22.4 51.2-51.2 51.2z m32-192c0 28.8-16 51.2-32 51.2-19.2 0-32-22.4-32-51.2L448 259.2c0-28.8 48-51.2 67.2-51.2 19.2 0 67.2 22.4 67.2 51.2l-38.4 364.8z" fill="#c11e30" p-id="70807" data-spm-anchor-id="a313x.search_index.0.i45.66873a819z1wHo" class="selected"></path></svg>  <span class="caution">Caution</span>`,
    },
    config: (md) => {
      md.use(markdownItPlantuml);
      md.use(mdItCustomAttrs, "image", {
        "data-fancybox": "gallery",
      });
      md.use(markdownItTaskLists);
    },
  },
  vite: {
    server: {
      open: false,
      port: 9527,
    },
  },
});
